 # 1.Даны три целых числа: A, B, C. Проверить истинность высказывания: "Каждое из чисел A,B,C положительное".
 # 2. Дано челое число. Вывести его строку-описание вида "отрицательное четное число","положительное нечетное число" итд
try:
  # Ввод чисел о
  A = int(input("Введите число A: "))
  B = int(input("Введите число B: "))
  C = int(input("Введите число C: "))

  # Проверка условия
  if A > 0 and B > 0 and C > 0:
    print("Истина: Все числа положительные!")
  else:
    print("Ложь: Не все числа положительные ")

except ValueError:
  print("Ошибка: Пожалуйста, введите корректные целые числа.")




