 # 1.Даны три целых числа: A, B, C. Проверить истинность высказывания: "Каждое из чисел A,B,C положительное".
 # 2. Дано челое число. Вывести его строку-описание вида "отрицательное четное число","положительное нечетное число" итд
a, b, c = int(input("введите первое число: "), int(input("введите второе число: "), int(input("введите третье число: "))
if a > 0:
    print("число ПОЛОЖИТЕЛЬНОЕ")
elif a < 0:
    print("число ОТРИЦАТЕЛЬНОЕ")
    if b > 0:
     print("число положительное")
    elif b < 0:
     print("число ОТРИЦАТЕЛЬНОЕ")
    if c > 0:
      print("число положительное")
    elif c < 0:
     print("число ОТРИЦАТЕЛЬНОЕ")