# 2. Дано челое число. Вывести его строку-описание вида "отрицательное четное число","положительное нечетное число" итд
try:
    number = int(input("введите число для анализа:"))
except ValueError:
    print("введи нормальное число без запятых и всякой бурмалды")
    number = int(input("введите число для анализа:"))
    if number % 2 == 0 and number > 0:
        print("положительное четное число")
    elif number < 0 and number % 2 == 0:
        print("отрицательное четное число")
    elif number < 0 and number % 2 != 0:
        print("отрицательное нечетное число")
    elif number > 0 and number % 2 != 0:
        print("положительное нечетное число")

